In [ ]:
#Data.csv

**Step 1: Importing the libraries**

In [1]:
import pandas as pd 
import numpy as np
from sklearn.preprocessing import MinMaxScaler

In [157]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

**Step 2: Importing dataset**

In [85]:
data = pd.read_csv("Data.csv")
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**Step 3: Handling the missing data**

In [86]:
data.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [87]:
data.fillna({'Salary':round(data["Salary"].mean(),1),'Age':round(data["Age"].mean(),1)},inplace = True)
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63777.8       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.8  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**Step 4: Encoding categorical data**

In [131]:
encoder = OneHotEncoder(dtype=np.int32)
dfEncodedFeatures = encoder.fit_transform(np.array(data["Country"]).reshape(-1,1))
columnsNames = encoder.categories_
df = pd.DataFrame(dfEncodedFeatures.toarray(),columns = columnsNames)
array = dfEncodedFeatures.toarray()
columnsNames

[array(['France', 'Germany', 'Spain'], dtype=object)]

**Step 5: Creating a dummy variable**

In [148]:
data.drop("Country",axis =1 ,inplace = True)
#i = 0
#for name in columnsNames:
#    data.insert(loc=i,column = name , value = array[:,i])
#    i=i + 1
data.insert(loc = 0,column = "France",value = array[:,0])
data.insert(loc = 1,column = "Germany",value = array[:,1])
data.insert(loc = 2,column = "Spain",value = array[:,2])
data

   France  Germany  Spain   Age   Salary Purchased
0       1        0      0  44.0  72000.0        No
1       0        0      1  27.0  48000.0       Yes
2       0        1      0  30.0  54000.0        No
3       0        0      1  38.0  61000.0        No
4       0        1      0  40.0  63777.8       Yes
5       1        0      0  35.0  58000.0       Yes
6       0        0      1  38.8  52000.0        No
7       1        0      0  48.0  79000.0       Yes
8       0        1      0  50.0  83000.0        No
9       1        0      0  37.0  67000.0       Yes

**Step 6: Splitting the datasets into training sets and Test sets**

In [156]:
X = data.iloc[:,:-1]
y = data.iloc[:,-1]
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size = 0.3,random_state = 5)

**Step 7: Feature Scaling**

In [167]:
stdScaler = StandardScaler()
tr_Xtrain = stdScaler.fit_transform(X_train[["Age","Salary"]])
tr_Xtest = stdScaler.fit_transform(X_test[["Age","Salary"]])

In [168]:
tr_Xtrain = np.concatenate((tr_Xtrain,X_train.iloc[:,:3]),axis = 1)
tr_Xtest = np.concatenate((tr_Xtest,X_test.iloc[:,:3]),axis = 1)

In [169]:
tr_Xtrain

array([[-0.11723896, -0.14437703,  0.        ,  1.        ,  0.        ],
       [ 1.01472343,  1.10300015,  1.        ,  0.        ,  0.        ],
       [-1.95667786, -1.43728264,  0.        ,  0.        ,  1.        ],
       [ 0.44874224,  0.52938791,  1.        ,  0.        ,  0.        ],
       [ 1.29771403,  1.43077858,  0.        ,  1.        ,  0.        ],
       [-0.28703332, -1.10950421,  0.        ,  0.        ,  1.        ],
       [-0.40022956, -0.37200276,  0.        ,  0.        ,  1.        ]])

In [170]:
tr_Xtest

array([[ 1.01904933,  1.34890655,  1.        ,  0.        ,  0.        ],
       [ 0.33968311, -0.30656967,  1.        ,  0.        ,  0.        ],
       [-1.35873244, -1.04233688,  0.        ,  1.        ,  0.        ]])